src/main/resources/xml/accommodationFulfillmentServicePort/retrieveGuestSummary/retrieveGuestSummary.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:retrieveGuestSummary>
         <request>
            <!--Optional:-->
            <travelPlanId>?</travelPlanId>
            <!--Optional:-->
            <travelPlanSegmentId>?</travelPlanSegmentId>
            <!--Optional:-->
            <travelComponentGroupingId>?</travelComponentGroupingId>
            <!--Optional:-->
            <enterpriseFacilityId>?</enterpriseFacilityId>
            <!--Optional:-->
            <roomNumber>?</roomNumber>
            <!--Optional:-->
            <arrivalDate>?</arrivalDate>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:retrieveGuestSummary>
   </soapenv:Body>
</soapenv:Envelope>
